

def test(text, truth, startRule, endRule):
    pass

#### All rules are dependent upon Softness
def testAllRules():
    pass


def testSoftness():
    text =  ["ле́т", "зима́",  "я́рус", "све́т",  "питьё",  "бле́дный",  "включа́ть",  "где́",  "гря́зный",  "сле́дующий"]
    truth = ["лэ́т", "з'има́", "а́рус", "св'э́т", "п'ит'о́", "бл'э́дный", "вкл'уча́т'", "гд'э́", "гр'а́зный", "сл'э́дуущий"]
    startRule = 0
    endRule = 0

def testEeKratkoye():
    text =  ["сле́дующий",   "чле́н",  "чьи́",  "извиня́юсь",    "я́рус",  "чуде́сный",  "мо́ю",  "я́щик",   "питьё",   "съе́л"]
    truth = ["сл'э́дуйущий", "чл'э́н", "ч'йи́", "изв'ин'а́йус'", "йа́рус", "чуд'э́сный", "мо́йу", "йа́щ'ик", "п'ит'йо", "сйэ́л"]
    startRule = 1
    endRule = 4

def testYeri():
    text =  ["живо́т", "щи́",  "сыгра́ть", "мы́шь","ци́кл", "лы́жи", "де́ньги",   "дружи́ть", "чи́щу",  "бо́льший"]
    truth = ["жыво́т", "щ'и́", "сыгра́т'", "мы́ш", "цы́кл", "лы́жы", "д'э́н'г'и", "дружы́т'", "ч'и́щу", "бо́л'шый"]
    startRule = 5
    endRule = 5

def testAkanje():
    text =  ["берегово́й",   "молокосо́с", "острова́", "ка́федра",  "го́лову", "обжо́ра", "ско́вороды", "го́родом", "магази́н",  "грома́дность"]
    truth = ["б'ер'егʌво́й", "мълъкʌсо́с", "ʌстрʌва́", "ка́ф'едръ", "го́лъву", "ʌбжо́ръ", "ско́въръды", "го́ръдъм", "мъгʌз'и́н", "грʌма́днъс'т'"]
    startRule = 6
    endRule = 7

def testTenseYaYe():
    text =  ["проче́сть",   "сове́тница",    "две́сти",    "боле́л",  "боле́ли",   "де́ле",   "све́тит",   "ча́сть",   "вычисля́ть",    "я́щик"]
    truth = ["проч'э̂с'т'", "сов'э̂т'н'ица", "дв'э̂с'т'и", "бол'э́л", "бол'э̂л'и", "д'э̂л'е", "св'э̂т'ит", "ч'а̂с'т'", "выч'ис'л'а̂т'", "йа̂щ'ик"]
    startRule = 8
    endRule = 8
    # Depends on Softness Assimilation

def testIkanje():
    text =  ["язы́к",  "ерунда́",  "еди́нственно",    "чепуха́",  "телефо́н",   "берегово́й",   "весна́",  "серебро́",   "о́череди",    "пятьдеся́т"]
    truth = ["йизы́к", "йьрунда́", "йид'и́нств'ьнно", "ч'ьпуха́", "т'ьл'ифо́н", "б'ьр'ьгово́й", "в'исна́", "с'ьр'ибро́", "о́ч'ьр'ьд'и", "п'ьт'д'ис'а́т"]
    startRule = 9
    endRule = 10
    # Depends on EeKratkoye

def testYkanje():
    text =  ["уценена́",  "жесто́кий",  "шелуха́", "шесто́й", "ше́рсть", "це́лый", "же́ртва", "шевели́ться",   "целико́м",  "кольцево́й"]
    truth = ["уцън'ена́", "жысто́к'ий", "шълуха́", "шысто́й", "шэ́рст'", "цэ́лый", "жэ́ртва", "шъв'ел'и́тс'я", "цъл'ико́м", "кол'цыво́й"]
    startRule = 11
    endRule = 12

def testFinalDevoicing():
    text =  ["пло́д", "гла́з", "зу́б", "но́ж", "дру́г", "сто́рож", "отре́жь",  "ся́дь",  "до́м", "ста́р"]
    truth = ["пло́т", "гла́с", "зу́п", "но́ш", "дру́к", "сто́рош", "от'р'э́ш", "с'а́т'", "до́м", "ста́р"]
    startRule = 13
    endRule = 13

def testClusterUnvoicedAssimilation():
    text =  ["тру́бка", "ло́дка", "вку́с", "коро́бка", "ска́зка", "второ́й"]
    truth = ["тру́пкъ", "ло́ткъ", "фку́с", "кʌро́пкъ", "ска́скъ", "фтʌро́й"]
    startRule = 14
    endRule = 14

def testClusterVoiceAssimilation():
    text =  ["про́сьба", "вокза́л", "сгоре́л",  "све́т",  "сво́лочь", "сде́лал"]
    truth = ["про́з'бъ", "вʌгза́л", "згʌр'э́л", "св'э́т", "сво́лоч",  "зд'э́лал"]
    startRule = 15
    endRule = 15

def testSoftnessAssimilation():
    text =  ["ча́сть",   "вперёд",    "две́рь",  "вме́сте",     "ски́дка",  "клева́ть",  "твёрдая",  "присе́сть",    "проче́сть",   "сове́тница"]
    truth = ["ч'а́с'т'", "в'п'ер'о́д", "дв'э́р'", "в'м'э́с'т'е", "ск'и́тка", "кл'ева́т'", "тв'о́рдая", "пр'ис'э́с'т'", "проч'э́с'т'", "сов'э́т'н'ица"]
    startRule = 16
    endRule = 18
